Repository: ystk/debian-kerberos-configs
Catalog: debian/po/*.po
Languages: fr

source: Configuring Kerberos Authentication
fr: Configuration de l'authentification Kerberos

source: Default Kerberos version 5 realm:
fr: Royaume (« realm ») Kerberos version 5 par défaut :

source: When users attempt to use Kerberos and specify a principal or user name without specifying what administrative Kerberos realm that principal belongs to, the system appends the default realm. The default realm may also be used as the realm of a Kerberos service running on the local machine. Often, the default realm is the uppercase version of the local DNS domain.
fr: Quand les utilisateurs tentent d'utiliser Kerberos et indiquent un principal ou un identifiant sans préciser à quel royaume (« realm ») administratif Kerberos ce principal est attaché, le système ajoute le royaume par défaut. Le royaume par défaut peut également être utilisé comme royaume d'un service Kerberos s'exécutant sur la machine locale. Il est d'usage que le royaume par défaut soit le nom de domaine DNS local en majuscules.

source: Add locations of default Kerberos servers to /etc/krb5.conf?
fr: Ajouter les emplacements des serveurs Kerberos par défaut dans /etc/krb5.conf ?

source: Typically, clients find Kerberos servers for their default realm in the domain-name system. ${dns}
fr: Habituellement, les clients recherchent les serveurs Kerberos de leur royaume par défaut en utilisant le système de nom de domaine. ${dns}

source: short description unused
fr: courte description inutilisée.

source: However, the Kerberos servers for your realm do not appear to be listed either in the domain-name system or the kerberos configuration file shipped with Debian. You may add them to the Kerberos configuration file or add them to your DNS configuration.
fr: Cependant, les serveurs Kerberos du royaume utilisé par cette machine ne semblent pas être référencés dans le système de nom de domaine ou dans le fichier de configuration Kerberos fourni avec Debian. Vous devriez les ajouter au fichier de configuration Kerberos ou dans le DNS.

source: Servers for your realm were found in DNS. For most configurations it is best to use DNS to find these servers so that if the set of servers for your realm changes, you need not reconfigure each machine in the realm. However, in special situations, you can locally configure the set of servers for your Kerberos realm.
fr: Les serveurs pour le royaume utilisé sur cette machine ont été trouvés dans le DNS. Il est le plus souvent préférable d'utiliser le DNS afin de ne pas avoir à reconfigurer les clients si les serveurs changent. Cependant, dans des situations particulières, il est possible d'indiquer localement quels sont les serveurs pour le royaume Kerberos.

source: Kerberos servers for your realm:
fr: Serveurs Kerberos du royaume :

source: Enter the hostnames of Kerberos servers in the ${realm} Kerberos realm separated by spaces.
fr: Veuillez indiquer les noms d'hôtes des serveurs Kerberos dans le royaume Kerberos ${realm}, séparés par des espaces.

source: Administrative server for your Kerberos realm:
fr: Serveur administratif du royaume Kerberos :

source: Enter the hostname of the administrative (password changing) server for the ${realm} Kerberos realm.
fr: Veuillez indiquer le nom d'hôte du serveur administratif (permettant les modifications de mot de passe) pour le royaume Kerberos ${realm}.
